<a href="https://colab.research.google.com/github/LumyMaral/FECAP-IA/blob/main/Ol%C3%A1%2C_este_%C3%A9_o_Colaboratory.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [3]:
import pandas as pd

In [4]:
dic = {'Nome':['Isa', 'Peter', 'Rico'],
       'Idade':['19', '20', '0'],
       'Salario':['19000', '5000', '100'],
       'Genero':['F', 'M', 'honda civic'],
       'Cargo':['Gerente', 'Supervisor', '']
}

In [5]:
df = pd.DataFrame(dic)
df

    Nome Idade Salario       Genero       Cargo
0    Isa    19   19000            F     Gerente
1  Peter    20    5000            M  Supervisor
2   Rico     0     100  honda civic

In [6]:
print(df)

    Nome Idade Salario       Genero       Cargo
0    Isa    19   19000            F     Gerente
1  Peter    20    5000            M  Supervisor
2   Rico     0     100  honda civic

In [7]:
df.info

<bound method DataFrame.info of     Nome Idade Salario       Genero       Cargo
0    Isa    19   19000            F     Gerente
1  Peter    20    5000            M  Supervisor
2   Rico     0     100  honda civic            >

In [ ]:
df = pd.get_dummies(df,columns=['Genero'])#codigpo ahfjsi

In [15]:
df

    Nome Idade Salario       Cargo  Genero_F  Genero_M  Genero_honda civic
0    Isa    19   19000     Gerente         1         0                   0
1  Peter    20    5000  Supervisor         0         1                   0
2   Rico     0     100                     0         0                   1

In [18]:
df = df.drop(columns=['Cargo'])

In [19]:
df

    Nome Idade Salario  Genero_F  Genero_M  Genero_honda civic
0    Isa    19   19000         1         0                   0
1  Peter    20    5000         0         1                   0
2   Rico     0     100         0         0                   1